{"systemPages":[{"title":"Register","url":"/register","description":"We are glad you are here. Let's get your account set up!","image":"","stateName":"register","legacyStyles":false},{"title":"Reset Password","url":"/reset-password","description":"Need to reset your password? We can fix that with a few simple steps and you'll on your way in no time.","image":"/assets/","stateName":"resetPassword","legacyStyles":true},{"title":"GO Trips","url":"http://crossroadsgotrips.net/","description":"Crossroads is one church with multiple locations in the Greater Cincinnati area. Each year, we send hundreds of people on GO Trips around the world. You may have heard of “mission trips” before. We say GO, because we believe that something unique happens when you leave familiar surroundings. Every GO Trip builds community, furthers sustainable work, and leads to positive change. That’s why trips outside of Cincinnati have been a consistent part of Crossroads since 2006.\r\n","image":"","stateName":"gotrips","legacyStyles":true},{"title":"Series","url":"/series","description":"View all past and current message series at Crossroads.","image":"","stateName":"media.series","legacyStyles":true},{"title":"The Journey Home","url":"http://makethejourneyhome.com/","description":"AT SOME POINT IN OUR LIVES,\r\nWE’VE ALL FELT LIKE WE DIDN’T QUITE BELONG.\r\n\r\nSo we put up a good front. And we may have gotten pretty good at it. But no matter how successful and in-control the world sees us, we can still find ourselves feeling alone or exhausted by the effort. This can change.\r\n\r\nWhat if it was possible to feel completely at home, no matter where you were? What if you could always feel understood, valuable, protected and loved? What if you could let down your guard, get recharged, find rest and be filled with bravery and hope?\r\n\r\nNo matter where you are right now, you can.\r\nThis is the journey home.","image":"","stateName":"thejourneyhome","legacyStyles":true},{"title":"Mason Race","url":"https://www.itsyourrace.com/event.aspx?id=9299","image":"","stateName":"masonrace","legacyStyles":true},{"title":"Profile","url":"/profile/personal","description":"Tell us who you are, what you care about and what you want to hear. You'll also be able to sign up for groups and have free access to all our media. Pretty sweet, huh?","image":"","stateName":"profile","legacyStyles":true},{"title":"Trip Progress","url":"/trips/mytrips","description":"View and download your GO Trip information.","image":"https://crds-cms-uploads.imgix.net/content/images/gotrips.png","stateName":"mytrips","legacyStyles":true},{"title":"Group Search","url":"/groups/search","description":"Groups, they help us discover who God is, who we are and what we were made to do. So we care a lot about Groups. From dude groups on a back porch, Bible studies in the home, family groups on playgrounds, business groups in a conference room or adventure groups out on a trail, God is just waiting to move in our lives wherever we are,","image":"","stateName":"grouptool.search","legacyStyles":true},{"title":"Search Results","url":"/groups/search/results","description":"RELATIONSHIPS ARE CRITICAL TO GROWTH.  Join a group!","image":"https://crds-cms-uploads.imgix.net/content/images/groups-01-1.png","stateName":"grouptool.search-results","legacyStyles":true},{"title":"Search","url":"/search","description":"Use this feature to navigate through Crossroads.net.","image":"","stateName":"search","legacyStyles":false},{"title":"Childcare Signup","url":"/serve","description":"Choose which of your children you want to enroll in childcare during your event","image":"","stateName":"childcare-event","legacyStyles":true},{"title":"Videos","url":"/videos","description":"View all past and current videos at Crossroads.","image":"","stateName":"media.videos","legacyStyles":true},{"title":"Explore","url":"/explore","description":"Crossroads is for anyone who wants to seek God-from those exploring whether or not God even exists, to committed Christ-followers. We present biblical truths and show how they apply to our everyday lives. And we have a lot of fun while doing it.","image":"https://crds-cms-uploads.imgix.net/content/images/explore-social.png","stateName":"explore","legacyStyles":true},{"title":"The Daily","url":"/thedaily","description":"We make it easy for you with The Daily\u0026mdash;an electronic tool that helps you regularly engage with the Bible and prayer. Able to be completed in just 15 minutes, each day follows a simple format of reading, reflection and response. Sign up today.","image":"","stateName":"thedaily","legacyStyles":true},{"title":"Forgot Password","url":"/forgot-password","description":"Forgot your password? We can fix that with a few simple steps.","image":"","stateName":"forgotPassword","legacyStyles":false},{"title":"Give to Someones Trip","url":"/trips/search","description":"Give to Someone’s Trip\r\n\r\nYou play an important role in transformation\r\n\r\nThanks for your generosity in contributing to someone’s GO trip. These trips are often life-changing experiences, and through your giving you play an important role in that transformation. Type a name or email address in the search box below to contribute to that individual’s trip fund.","image":"","stateName":"tripsearch","legacyStyles":true},{"title":"Reset Journey","url":"http://resetjourney.net","description":"Whether you're just beginning the seeking journey or you've followed Jesus for decades, the Reset journey will challenge all of us to confront our expectations and discover (or rediscover) our own beliefs about the most influential person in history.","image":"","stateName":"resetjourney","legacyStyles":true},{"title":"Big Night For Teens","url":"http://bignightforteens.com/","description":"There are a lot of messages out there pointed at teens (thanks, Facebook). We want them to hear something different. BIG is all about giving teens a place to be themselves, make friends and hear an inspiring message—plus, there's tons of free food, games and music. \r\n\r\nThis is the biggest night for teens because they’ll hear a message that motivates and inspires their daily lives. \r\n\r\nThe next BIG is Sunday, February 14 at 5pm.","image":"","stateName":"bignightforteens","legacyStyles":true},{"title":"Childcare","url":"/childcare","description":"RSVP your children for childcare","image":"","stateName":"childcare-dashboard","legacyStyles":true},{"title":"Trip Giving","url":"/trips/search/","description":"Support a teammate by helping them fund an upcoming trip.","image":"https://crds-cms-uploads.imgix.net/content/images/gotrips.png","stateName":"tripgiving","legacyStyles":true},{"title":"Live Streaming","url":"/live","description":"Watch Crossroads Anywhere live online. SAT 4:30pm, 6:15pm, 8pm, 10pm,\r\nSUN 8:30am, 10:05am, 11:45am, 2pm, 4pm, 6pm, 8pm, 10pm, and on demand throughout the week!","image":"https://crds-cms-uploads.imgix.net/content/images/anywhere-social-share.jpg","stateName":"live","legacyStyles":true},{"title":"Crossroads Old Saint George","url":"https://crossroadsosg.com/","description":"There's a new community to reach—students and professors, doctors and artists, neighbors and business owners. 99% of students at UC aren't part of a church on campus. And we know that half of all graduates stay and take jobs in Cincinnati. These are Cincinnati's influencers and future leaders. These are the people whose hearts and minds we want to introduce to Jesus' love and power.","image":"","stateName":"crossroadsosg","legacyStyles":true},{"title":"Sign Out","url":"/signout","description":"Thank you for visiting. Let's get you securely signed out of the system.","image":"","stateName":"logout","legacyStyles":true},{"title":"Discipleship","url":"https://discipleship.crossroads.net","description":"We were made to look and act like Jesus—wholeheartedly. To live as He lived. Heal as He healed. Free others the way He freed us. But how do we actually move in that direction? How do we get up from an inspiring weekend service to experiencing radical, daily life change, and helping others experience the same?\r\n\r\nAt Crossroads, we’re throwing our weight behind a discipleship culture. It’s our way of resourcing people (aka potential disciples) to continually grow in their relationship with Jesus, and to take Him into their homes, marriages, neighborhoods, spheres of influence, racquetball courts, everywhere. So, from Huddles to GO Groups to homes, we are pounding the pavement. And we believe that a thriving community of maturing Jesus followers will transform Cincinnati into a landscape of freedom and power.","image":"https://crds-cms-uploads.imgix.net/content/images/LandingPageCoverImg.jpg","stateName":"discipleship","legacyStyles":true},{"title":"Atrium Events","url":"/atriumevents","description":"Atrium Displays for today's events","image":"","stateName":"atriumEvents","legacyStyles":true},{"title":"Media","url":"/media","description":"View all past and current media at Crossroads.","image":"","stateName":"media.all","legacyStyles":true},{"title":"Strong Challenge","url":"http://strongchallenge.com/","description":"Welcome to the STRONG Challenge, where thousands of people in Cincinnati and beyond are experimenting with daily spiritual challenges to make space for God in our lives. These challenges aren't religious tasks; they're relationship-builders. Because the more we encounter God, the more our relationships with him grow. And that's when we get STRONG.","image":"","stateName":"strongchallenge","legacyStyles":true},{"title":"Sign In","url":"/signin","description":"Let's get you signed in so you can begin exploring Crossroads.net.","image":"","stateName":"login","legacyStyles":false},{"title":"Music","url":"/music","description":"View all past and current music at Crossroads.","image":"","stateName":"media.music","legacyStyles":true},{"title":"GO Cincinnati","url":"http://gocincinnati.net","description":"We love Cincinnati. (All of it.)\r\nAnd that love extends way beyond the city limits—we’re spreading it from Burlington to Middletown and all the neighborhoods in between. We call it GO Cincinnati because we take on projects all over the region. And let’s face it, GO Flomasoak doesn’t really flow off the tongue. So GO Cincinnati it is, and this is how we do it: a one-day compassion blitz, investing our love into hundreds of work projects all over town. \r\n \r\nIn 2012, 6,000 of us from 50 churches got dirty and sweaty, with paint-splattered hands and mulch-stained shirts, at one of hundreds of projects. And while all the projects were different, one similarity stood out: everyone helped bring hope and life to something that previously seemed hopeless and lifeless. New flowers replaced weeds. Vibrant murals covered dirty walls.","image":"https://crds-cms-uploads.imgix.net/content/images/go-cincy-social.png","stateName":"gocincinnati","legacyStyles":true},{"title":"Kids Club Website","url":"http://crossroadskidsclub.net/","description":"Kids' Club is the infant through fifth-grade ministry for Crossroads Church.\r\n\r\nWe are a community of people who are seeking God - from those who are brand new to the whole \"church\" thing to committed followers of Jesus.","image":"https://crds-cms-uploads.imgix.net/content/images/kidsclub-logo.jpg","stateName":"kidsclub","legacyStyles":true},{"title":"Style Guide","url":"/styleguide","image":"","stateName":"styleguide","legacyStyles":true},{"title":"Give","url":"/give","description":"It's the generosity of everyday people in our community that fuels the life change that we experience around here. Check out the link below to set up or modify your giving profile.","image":"","stateName":"give","legacyStyles":true},{"title":"Trip Signup","url":"/reachout/go","description":"Are you ready to GO? Complete your application today.","image":"","stateName":"tripsignup.application","legacyStyles":true},{"title":"The Journey Partners","url":"http://www.thejourneypartners.org/","description":"For the past seven years, churches have been getting on the same page for a six-week journey. We zero in on one topic and everyone—from kids to old folks—grows in similar ways. By enhancing churches’ weekend messages with individual study and small group gatherings, the journey becomes a multi-layered, multi-sensory, multi-community experience.","image":"","stateName":"thejourneypartners","legacyStyles":true},{"title":"Trip Signup","url":"/reachout/go","description":"Are you ready to sign up for a GO trip? Sign up today.","image":"","stateName":"tripsignup","legacyStyles":true},{"title":"Leave Your Mark | I'M IN Journey","url":"/leaveyourmark","description":"Since November 2015, the Crossroads team has been charging after a three-year financial campaign called I’M IN. ","image":"https://crds-cms-uploads.imgix.net/content/images/iminlogotext.png","stateName":"leaveyourmark","legacyStyles":true},{"title":"Awaited Show","url":"http://www.awaitedshow.com/","description":"Awaited is a creative retelling of the Christmas story.\r\nIt’s a story full of risk, rejection and unexpected rescue by a long-awaited King. It is the story of how God relentlessly pursues each of us with his love and freedom, no matter who we are, what we’ve lived through or where we’ve come from. It is a story that has the power to change us all. ","image":"","stateName":"awaitedshow","legacyStyles":true},{"title":"Corkboard","url":"/corkboard","description":"The Corkboard is for posting needs, FREE items, events and job opportunities only.","image":"","stateName":"corkboard.root","legacyStyles":true},{"title":"Blog","url":"/blog","description":"Stay connected with all the incredible things happening in our community.","image":"","stateName":"blog","legacyStyles":true},{"title":"Signup to Serve","url":"/serve-signup","description":"Sign up for a number of serving opportunties at Crossroads.","image":"","stateName":"serve-signup","legacyStyles":true},{"title":"Giving History","url":"/givinghistory","description":"View and modify your giving history at Crossroads.","image":"","stateName":"history","legacyStyles":true},{"title":"Connect with Each Other","url":"https://www.crossroads.net/connect/","description":"Connect with others attending Crossroads from all across the world. Don't be shy, look around and say hi or put yourself on the map.","image":"https://crds-cms-uploads.imgix.net/content/images/connect-still.png","stateName":"connect","legacyStyles":true}]}